Repository: oandregal/poss-gl
Catalog: tmx/ch09.tmx
Source language: en
Languages: gl

source: The harm done to free software by software patents is more insidious than just direct threats to code development, however. Software patents encourage an atmosphere of secrecy among firmware designers, who justifiably worry that by publishing details of their interfaces they will be giving technical help to competitors seeking to slap them with patent infringement suits. This is not just a theoretical danger; it has apparently been happening for a long time in the video card industry, for example. Many video card manufacturers are reluctant to release the detailed programming specifications needed to produce high-performance open source drivers for their cards, thus making it impossible for free operating systems to support those cards to their full potential. Why would the manufacturers do this? It doesn't make sense for them to work <emphasis>against</emphasis> software support; after all, compatibility with more operating systems can only mean more card sales. But it turns out that, behind the design room door, these shops are all violating one another's patents, sometimes knowingly and sometimes accidentally. The patents are so unpredictable and so potentially broad that no card manufacturer can ever be certain it's safe, even after doing a patent search. Thus, manufacturers dare not publish their full interface specifications, since that would make it much easier for competitors to figure out whether any patents are being infringed. (Of course, the nature of this situation is such that you will not find a written admission from a primary source that it is going on; I learned it through a personal communication.)
gl: O dano feito ao software libre polas patentes do software é máis insidioso que unicamente as ameazas directas ao desenvolvemento de software. As patentes de software fomentan unha atmosfera de secretismo entre os deseñadores de <foreignphrase>firmware</foreignphrase>, os cales están (xustificadamente) preocupados con publicar detalles das súas interfaces que lle dean axuda técnica á súa competencia na súa procura de golpealos con xuízos de infrinxencia de patentes. Isto non é só un perigo teórico: aparentemente está sucedendo desde hai tempo na industria das tarxetas gráficas, por exemplo. Moitos fabricantes de tarxetas gráficas son reticentes a publicaren as especificacións programáticas precisas para produciren controladores de código aberto de alto rendemento para as tarxetas, provocando que sexa imposible para os sistemas operativos libres darlle soporte a esas tarxetas para despregar completamente o seu potencial. Por que farían isto os fabricantes? Para eles non ten sentido traballar <emphasis>contra</emphasis> o soporte software; despois de todo, a compatibilidade con máis sistemas operativos só pode supor unha maior venda de tarxetas. Mais resulta que tras da porta de deseño, estes fabricantes están violando patentes de outros, algunhas veces deliberadamente e outras veces accidentalmente. As patentes son tan imprevisibles e potencialmente tan extensas que ningún fabricante de tarxetas nunca pode estar seguro, mesmo despois de ter feita unha procura de patentes. Debido a isto, os fabricantes non se atreven a publicar a especificación completa de interfaces, dado que podería facerlle máis sinxelo á competencia supor se algunha patente está sendo infrinxida. (Por suposto, a natureza desta situación é tal que non vas atopar ningunha declaración escrita de ningunha fonte primaria acerca do que está a ocorrer: isto seino a través de comunicacións persoais).

source: Some free software licenses have special clauses to combat, or at least discourage, software patents. The GNU GPL, for example, contains this language:
gl: Algunhas licenzas de software libre teñen cláusulas especiais para combater, ou cando menos frear, as patentes de software. A GNU GPL, por exemplo, contén o seguinte (ten en conta que a continuación faise unha tradución NON oficial da "GNU General Public License" ao galego. Esta tradución non foi publicada po-la "FSF Free Software Foundation", e non apoia legalmente os termos de distribución do software que empregue a "GNU GPL", só o fai o texto orixinal en inglés. Porén, esperamos que esta tradución lle axude ás persoas galegofalantes a entenderen mellor a " GNU GPL".):

source: 7. If, as a consequence of a court judgment or allegation of patent infringement or for any other reason (not limited to patent issues), conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License. If you cannot distribute so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not distribute the Program at all. For example, if a patent license would not permit royalty-free redistribution of the Program by all those who receive copies directly or indirectly through you, then the only way you could satisfy both it and this License would be to refrain entirely from distribution of the Program. [...] It is not the purpose of this section to induce you to infringe any patents or other property right claims or to contest validity of any such claims; this section has the sole purpose of protecting the integrity of the free software distribution system, which is implemented by public license practices. Many people have made generous contributions to the wide range of software distributed through that system in reliance on consistent application of that system; it is up to the author/donor to decide if he or she is willing to distribute software through any other system and a licensee cannot impose that choice.
gl: 7. Se como consecuencia dun veredicto dun xulgado ou pola alegación de infrinxir unha patente ou por calquera outra razón (non limitada unicamente a cuestións de patentes) foren impostas condicións sobre vostede que contradiciren as cláusulas desta Licenza, estas non o eximen das cláusulas aquí descritas. Se vostede non pode distribuír o produto cumprindo totalmente coas obrigas relativas á resolución oficial e ao mesmo tempo coas obrigas que se describen neste contrato de Licenza, entón non poderá distribuír máis este produto. Por exemplo, se unha licenza de patente non permitir a distribución do Programa de forma libre de regalías (sen pagamento de regalías) por parte de quen as recibiren directa o indirectamente, entón a única forma de cumprir con ambas obrigas é renunciar á distribución do mesmo. [...] A intención desta sección non é a de inducilo a infrinxir ningunha lei de patentes, nin tampouco infrinxir ningún reclamo de dereitos, nin discutir a validez de tales reclamos; esta sección ten o único propósito de protexer a integridade do sistema de distribución do software libre, que está implementado por prácticas de licenza pública. Moita xente ten feito xenerosas contribucións á ampla gama de software distribuído baixo este sistema favorecendo así a constante aplicación deste sistema de distribución; é decisión do autor/doador se o seu Programa será distribuído empregando este ou outro sistema de distribución, e a persoa que recibir o software non pode obrigalo a facer ningunha escolla en particular.

source: The Apache License, Version 2.0 (<ulink url="http://www.apache.org/licenses/LICENSE-2.0"></ulink>) also contains anti-patent requirements. First, it stipulates that anyone distributing code under the license must implicitly include a royalty-free patent license for any patents they might hold that could apply to the code. Second, and most ingeniously, it punishes anyone who initiates a patent infringement claim on the covered work, by automatically terminating their implicit patent license the moment such a claim is made:
gl: A Apache License, Versión 2.0 (<ulink url="http://www.apache.org/licenses/LICENSE-2.0"></ulink>) tamén contén requisitos anti-patentes. Primeiro, estipula que calquera que distribúa código baixo esta licenza debe implicitamente incluír unha licenza libre de regalías para calquera patente que puidese ostentar e que se puidera aplicar ao código. Segundo, e máis enxeñoso, castiga a calquera que comezar un proceso por infrinxencia de patentes sobre o código cuberto, finalizando automaticamente a súa licenza de patente implícita no momento no que se fixer a devandita reclamación (a continuación transcríbese en idioma orixinal a cláusula en cuestión, dado que é a única versión con validez legal):

source: Although it is useful, both legally and politically, to build patent defenses into free software licenses this way, in the end these steps will not be enough to dispel the chilling effect that the threat of patent lawsuits has on free software. Only changes in the substance or interpretation of international patent law will do that. To learn more about the problem, and how it's being fought, go to <ulink url="http://www.nosoftwarepatents.com/"></ulink>. The Wikipedia article <ulink url="http://en.wikipedia.org/wiki/Software_patent"></ulink> also has a lot of useful information on software patents. I've also written a blog post summarizing the arguments against software patents, at <ulink url="http://www.rants.org/2007/05/01/how-to-tell-that-software-patents-are-a-bad-idea/"></ulink>.
gl: Aínda que é útil, tanto legal como politicamente, construír defensas contras as patentes para as licenzas de software libre, ao final estes pasos non son suficientes para anular os efectos nocivos que a ameaza das patentes ten sobre o software libre. Só mudanzas na substancia ou interpretación da lei internacional de patentes poderían facer isto. Para aprenderes máis sobre este problema, e como se está combatendo, diríxite a <ulink url="http://www.nosoftwarepatents.com/"></ulink>. O artigo da Wikipedia inglesa <ulink url="http://en.wikipedia.org/wiki/Software_patent"></ulink>, así como os respectivos artigos noutros idiomas como o galego, tamén teñen moita información útil sobre patentes de software. Escribín unha entrada no meu blog resumindo os argumentos en contra das patentes de software en <ulink url="http://www.rants.org/2007/05/01/how-to-tell-that-software-patents-are-a-bad-idea/"></ulink>.

source: Further Resources
gl: Recursos adicionais

source: This chapter has only been an introduction to free software licensing issues. Although I hope it contains enough information to get you started on your own open source project, any serious investigation of licensing issues will quickly exhaust what this book can provide. Here is a list of further resources on open source licensing:
gl: Este capítulo só foi unha introdución ás cuestións do licenciamento do software libre. Contodo, espero que conteña información de abondo para que poidas comezar o teu propio proxecto de software libre. Calquera investigación seria sobre cuestións de licenciamento pode facilmente aumentar a información que este libro pode fornecer. Aquí vai unha lista de recursos adicionais sobre licenciamento de software libre:

source: <citetitle>Understanding Open Source and Free Software Licensing</citetitle> by Andrew M. St. Laurent. Published by O'Reilly Media, first edition August 2004, ISBN:&nbsp;0-596-00581-4.
gl: <citetitle>Understanding Open Source and Free Software Licensing</citetitle> por Andrew M. St. Laurent. Publicado por O'Reilly Media, primeira edición en Agosto de 2004, ISBN:&nbsp;0-596-00581-4.

source: This is a full-length book on open source licensing in all its complexity, including many topics omitted from this chapter. See <ulink url="http://www.oreilly.com/catalog/osfreesoft/"></ulink> for details.
gl: Este é un libro completo sobre licenciamento de software libre en toda a súa complexidade, incluíndo moitos temas omitidos neste capítulo. Bótalle unha ollada a <ulink url="http://www.oreilly.com/catalog/osfreesoft/"></ulink> para máis detalles.

source: <citetitle>Make Your Open Source Software GPL-Compatible. Or Else.</citetitle> by David A. Wheeler, at <ulink url="http://www.dwheeler.com/essays/gpl-compatible.html"></ulink>.
gl: <citetitle>Make Your Open Source Software GPL-Compatible. Or Else.</citetitle> por David A. Wheeler, en <ulink url="http://www.dwheeler.com/essays/gpl-compatible.html"></ulink>.

source: This is a detailed and well-written article on why it is important to use a GPL-compatible license even if you don't use the GPL itself. The article also touches on many other licensing questions, and has a high density of excellent links.
gl: Este é un artigo detallado e ben escrito sobre a importancia de empregar unha licenza GPL compatible mesmo se non empregares a GPL en si mesma. O artigo tamén toca moitas outras cuestións relativas ao licenciamento, e ten unha alta densidade de excelentes ligazóns.

source: Creative Commons is an organization that promotes a range of more flexible and liberal copyrights than traditional copyright practice encourages. They offer licenses not just for software, but for text, art, and music as well, all accessible via a user-friendly license selector; some of the licenses are copylefts, some are non-copyleft but still free, others are simply traditional copyrights but with some restrictions relaxed. The Creative Commons web site gives extremely clear explanations of what it's about. If I had to pick one site to demonstrate the broader philosophical implications of the free software movement, this would be it.
gl: Creative Commons é unha organización que fomenta unha familia de dereitos de autor máis flexibles e liberais que os potenciados polos dereitos de autor tradicionais. Ofrecen licenzas non só para software, senón tamén para texto, arte, e música, todas accesibles mediante selectores amigables de licenza; algunhas das licenzas son copyleft, algunhas non son copyleft mais son libres, outras son simplemente licenzas tradicionais con algunhas restricións aminoradas. O sitio web de Creative Commons dá unhas explicacións extremadamente claras sobre o que tratan. Se tiver que elixir un sitio para demostrar as extensas implicacións filosóficas do movemento do software libre, escollería este.
